{
  "0c7967a489968ea9": "SEO des métadonnées côté serveur",
  "2352297103ab3af4": {
    "c": [
      {
        "c": "3. Liens en langues alternatives",
        "i": 2,
        "t": "h4"
      },
      {
        "c": "Les métadonnées incluent des liens alternatifs pour chaque locale prise en charge. Les moteurs de recherche utilisent ces balises hreflang pour afficher la bonne version linguistique dans les résultats de recherche, évitant ainsi les pénalités pour contenu dupliqué.",
        "i": 3,
        "t": "p"
      }
    ],
    "i": 1,
    "t": "div"
  },
  "3fdd0e8244abfbea": [
    {
      "c": "Métadonnées en direct pour cette page",
      "i": 1,
      "t": "h3"
    },
    {
      "c": "Changez de langue via le sélecteur ci-dessus pour voir les métadonnées se mettre à jour. Inspectez le code source de la page ou utilisez l'aperçu ci-dessous.",
      "i": 2,
      "t": "p"
    }
  ],
  "53b91a6c8504f5f9": {
    "c": "Métadonnées de la page actuelle",
    "i": 1,
    "t": "span"
  },
  "a12715052914ab49": {
    "c": "Comment ça marche",
    "i": 1,
    "t": "h3"
  },
  "a360648f4b57fc47": "Découvrez comment utiliser getGT avec generateMetadata pour créer des titres de page, des descriptions et des balises Open Graph localisés pour le référencement multilingue.",
  "c656b1b70f94bf38": {
    "c": [
      {
        "c": "1. Traduction côté serveur dans generateMetadata",
        "i": 2,
        "t": "h4"
      },
      {
        "c": "La fonction generateMetadata reçoit la locale depuis les paramètres de route. Elle appelle getGT pour obtenir une fonction de traduction, puis l'utilise pour traduire le titre et la description de la page avant de retourner l'objet de métadonnées.",
        "i": 3,
        "t": "p"
      }
    ],
    "i": 1,
    "t": "div"
  },
  "d2805811eb07276a": [
    {
      "c": "Métadonnées traduites pour le référencement multilingue",
      "i": 1,
      "t": "h2"
    },
    {
      "c": "Cette démo montre comment utiliser getGT dans generateMetadata de Next.js pour générer des titres de page, des descriptions et des balises Open Graph traduits. Chaque locale dispose de ses propres métadonnées, ce qui améliore la visibilité dans les moteurs de recherche pour toutes les langues.",
      "i": 2,
      "t": "p"
    }
  ],
  "da44de684bf4946f": {
    "c": [
      {
        "c": "2. Open Graph et Twitter cards",
        "i": 2,
        "t": "h4"
      },
      {
        "c": "Les chaînes traduites sont transmises aux champs openGraph et twitter de l'objet metadata. Lorsqu'une page est partagée sur les réseaux sociaux, l'aperçu affiche le texte dans la langue correcte.",
        "i": 3,
        "t": "p"
      }
    ],
    "i": 1,
    "t": "div"
  },
  "dfa161d16d996aca": {
    "c": "Exemple de code",
    "i": 1,
    "t": "h3"
  },
  "e4bc4b395e0b3ef6": "Démo SEO des métadonnées côté serveur | Traductions générales"
}